register-load-test.yml
config:
  target: 'http://backend-authservice-iosuff-40b5fe-16-170-110-247.traefik.me'
  phases:
    # Phase 1: Ramp up from 10 to 50 new users/sec over 15 seconds
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp-up Phase'

    # Phase 2: Sustain 50 new users/sec for 30 seconds
    - duration: 30
      arrivalRate: 50
      name: 'Sustain 50 users/sec'

  http:
    timeout: 30
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery Load Test'
      Origin: 'http://uploaddoc.app'

  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 800 # 95% of requests under 800ms
        - http.response_time.max: 2000 # Max 2 seconds
        - http.codes.5xx: 0 # No server errors

scenarios:
  - name: 'User Registration Load Test'
    flow:
      - post:
          url: '/auth/register'
          json:
            email: 'user_{{ $randomNumber(100000,999999) }}@gmail.com'
            username: 'Daniel_{{ $randomNumber(1000,9999) }}'
            password: '12345678'
            userType: 'normal'
            bio: 'Tech enthusiast. Always looking for ways to learn and grow in the tech world.'
            gender: 'male'
          expect:
            - statusCode: 201